[
  {
    "app_name": "Play Together VNG for Android - Free App Download",
    "package_name": "com.vng.playtogether",
    "Total downloads": "19 million",
    "Recent downloads": "430 thousand",
    "Rating": "4.00 based on 910 thousand ratings",
    "Ranking": "Not ranked",
    "APK size": "1.70 GB",
    "Designed for Android": "6.0+",
    "Ads": "Contains ads",
    "developer_info": {
      "name": "VNG Corporation",
      "email": "cs.studio9@vng.com.vn",
      "website": "https://playtogether.vnggames.net"
    },
    "about_section": "Play Together VNG is a casual game developed by VNG Corporation. The APK has been available since June 2022 . In the last 30 days, the app was downloaded about 430 thousand times. It's currently not in the top ranks. It's rated 4.00 out of 5 stars, based on 910 thousand ratings. The last update of the app was on June 2, 2025 . Play Together VNG has a content rating \"Medium Maturity\" . Play Together VNG has an APK download size of 1.70 GB and the latest version available is 2.16.0 . Designed for Android version 6.0+ . Play Together VNG is FREE to download.",
    "app_description": "Quyết định phê duyệt nội dung kịch bản trò chơi điện tử G1 trên mạng số 1009/QĐ-BTTTT do Bộ Thông tin và Truyền thông cấp ngày 02/06/2022.  \nGặp gỡ bạn bè khắp năm châu!\nĐây là Vũ Trụ Ảo nơi mà bạn bè từ khắp nơi trên thế giới có thể tụ tập! Hãy cùng nhau chơi Play Together?\n1. Một sân chơi ảo!\nTạo những khoảnh khắc đáng nhớ trong sân chơi ảo của chúng tôi với bạn bè của bạn!\nGặp gỡ những người bạn mới tại Plaza, đi mua sắm hoặc chơi những trò chơi ngắn đa dạng tại Game Center.\nChơi trò chơi trốn tìm với thây ma tại Nhà Ma vào ban đêm và thử chinh phục đỉnh Tháp Vô Cực tại Khu Cắm Trại.\nNhững người ở Plaza sẽ có những nhiệm vụ đặc biệt dành cho bạn! Hoàn thành các nhiệm vụ này và nhận phần thưởng!\nỞ Play Together, mỗi ngày đều là một trải nghiệm thú vị!\n2. Một cuộc phiêu lưu đặc biệt!\nTham gia một chuyến đi đặc biệt tại Play Together.\nDu lịch nước ngoài bằng cách đến Đại lý du lịch!\nGặp gỡ những người bạn mới từ khắp nơi trên thế giới và đánh dấu những nơi bạn đã ghé thăm!\nĐi thuyền đến Hòn đảo bị mất và tìm kiếm kho báu ẩn giấu!\n3. Tổ chức tiệc tại nơi ở của bạn\nHãy sáng tạo và trang trí ngôi nhà của bạn bằng cách sử dụng đồ nội thất với nhiều chủ đề khác nhau!\nCó nhiều chủ đề đầy màu sắc để bạn lựa chọn như người Ai Cập, Khối Đồ chơi, Thực vật học...\nNếu bạn đã trang trí xong ngôi nhà, đã đến lúc tổ chức Tiệc Tại Nhà!\nChủ đề của bữa tiệc có thể là bất cứ điều gì bạn thích!\nTiệc khiêu vũ, tiệc bể bơi, lớp học nấu ăn...\nGiới hạn duy nhất là trí tưởng tượng của bạn!\n4. Tạo phong cách với chất riêng của bạn!\nChỉ bạn mới có thể định hình bạn là ai!\nThể hiện bản thân với trang phục và phụ kiện!\nVán trượt, xe thể thao, khinh khí cầu, balo bay không gian hay xe địa hình? Đi du ngoạn khắp nơi với thú cưng đáng yêu và bạn bè của bạn!\n5. Thế giới côn trùng sống động\nCôn trùng có ở khắp mọi nơi, từ vườn hoa, quanh hồ nước đến những thân cây. \nVới một chiếc vợt trên tay, các bạn phải rón rén để tiếp cận và nhắm bắt chúng. Ồ hãy cẩn thận và đi thật chậm kẻo chúng bay đi mất. Bắt côn trùng và lấp đầy Từ điển côn trùng của riêng bạn!\n6. Thiên thạch khổng lồ ở Plaza!\nBạn có thể thu được các vật phẩm khác nhau bằng cách khai thác thiên thạch rơi xuống Plaza\nTất cả mọi người tiếp xúc với những tảng đá đều có thể khai thác khoáng thạch. Đá tảng sau khi được khai thác một số lần nhất định sẽ bị vỡ, vì vậy nếu bạn thấy đá thì phải nhớ khai thác ngay nhé.\nNgoài những vật phẩm có thể chế tạo bất cứ lúc nào, cũng có những vật phẩm giới hạn chỉ có thể được chế tạo trong thời gian nhất định. Hãy thu thập các vật liệu khai thác để chế tạo các vật phẩm mà bạn yêu thích!\nPERMISSION:\nFOREGROUND_SERVICE_MEDIA_PROJECTION: cho phép quay video \nFOREGROUND_SERVICE_DATA_SYNC: cho phép tải xuống bản cập nhật bổ sung\nRecent changes:\nChào đón các sự kiện hấp dẫn sắp tới:\nGió hè thổi căng buồm thôi! Hành trình khám phá biển khơi bắt đầu rồi đó! \n• Dùng máy dò đại dương để săn quái vật biển sâu và truy tìm kho báu bí ẩn!\n• [Nhật Ký Hành Trình Majesty]\n• [Bảng Điểm Danh Khám Phá Biển Khơi]\n• [Tìm Kho Báu Biển Cả!]\nRa khơi ngay hôm nay, kho báu không chờ ai đâu đó!\nCập nhật thông tin chi tiết hơn ở các kênh chính thức của Play Together nhé!",
    "api_details": {
      "permissions": {},
      "technologies": {
        "Ad network libraries": [
          "AdMob",
          "Facebook Audience Network",
          "Unity Ads",
          "Open Measurement",
          "AppLovin",
          "AppsFlyer",
          "Ironsource",
          "InMobi"
        ],
        "Social libraries": [
          "Facebook"
        ],
        "Development tools": [
          "Android Jetpack core",
          "Android Architecture Components",
          "Android Jetpack VersionedParcelable",
          "Firebase",
          "Android Jetpack Annotations",
          "Android Jetpack Widgets",
          "Android Jetpack AppCompat",
          "AndroidX Activity",
          "Android Activity Saved State",
          "AndroidX Loader",
          "Android Jetpack Media",
          "Google Cloud Messaging (GCM)",
          "Android Transition Support Library",
          "Android Support Library collections",
          "Android Support VectorDrawable",
          "AndroidX Legacy: Support Library core utils",
          "Kotlin",
          "AndroidX Cursor Adapter",
          "AndroidX Local Broadcast Manager",
          "Android Support Library Print",
          "Android Support Library Document File",
          "AndroidX Legacy: Support Library core UI",
          "Google gson",
          "Android Support Library Async Layout Inflater",
          "Android WorkManager",
          "Okio",
          "JetBrains Annotations",
          "IntelliJ IDEA",
          "AndroidX Multi-Dex Library",
          "AndroidX ExifInterface",
          "Google ZXing",
          "Picasso",
          "Retrofit",
          "Google Guava",
          "BoltsFramework",
          "Unity 3D",
          "FMOD Ex Programmers API",
          "The Checker Framework",
          "ShortcutBadger",
          "Google Play Licensing Service"
        ]
      },
      "raw_html_snippet": "<div>\n    <h2>\n        Permissions\n    </h2>\n    \n        <div class=\"row app-permissions\">\n            \n                <div class=\"col-sm-6 col-lg-4\">\n                    <div class=\"default-box-color vpadding-xs hpadding-s\">\n                        <b>Development tools</b>\n                        <div>\n                            \n                                test access to protected storage\n                            \n                        </div>\n                    </div>\n                </div>\n            \n                <div class=\"col-sm-6 col-lg-4\">\n                    <div class=\"default-box-color vpadding-xs hpadding-s\">\n                        <b>Network communication</b>\n                        <div>\n                            \n                                view network connections,\n                            \n                                view Wi-Fi connections,\n                            \n                                full network access,\n                ..."
    },
    "changelog": [
      {
        "date": "Jun 2, 2025",
        "type": "Update",
        "description": "Version 2.16.0"
      }
    ],
    "country": "US",
    "category": "Game",
    "status": "success",
    "url": "https://www.appbrain.com/app/body-color-swap/com.vng.playtogether",
    "timestamp": "2025-06-12T02:16:04.048562",
    "categories": "Game, Casual",
    "downloads": 1022868,
    "is_ad": "NO",
    "is_pub": "YES",
    "market_url": "https://play.google.com/store/apps/details?hl=vi_VN&gl=vn&id=com.vng.playtogether",
    "name": "Play Together VNG",
    "platform": "Android",
    "position": 10,
    "publisher_contacts": "info@prism.vn, mlbbvn@vng.com.vn, privacy@vng.com.vn, revelation@vng.com.vn, starter@vng.com.vn, hotro.lor@vng.com.vn, speedzsm2018@gmail.com, kto.support@vng.com.vn, forsakenworld2_feedback@vng.com.vn, hotro.tocchien@vng.com.vn, tdvng@vng.com.vn, hungnd4@vng.com.vn, minhlvv@vng.com.vn, tanthienlongmobile.vng@gmail.com, hotro.codmvn@vng.com.vn, gs1app.cs@vng.com.vn, store.admin@vng.com.vn, bomber@vng.com.vn, cloudsongservice@vng.com.vn, revelation.support@vng.com.vn, tft-mobile-support@riotgames.com, tlbb@vng.com.vn, thienlongbatbo2@vng.com.vn, mulucdiavng@vng.com.vn, cs.casualmobilegame@gmail.com, support@uprace.org, volamm@vng.com.vn, hotro.nmgh@vng.com.vn, ghoststory@vng.com.vn, admin_store@vng.com.vn, hellocafevn@vng.com.vn, vltkm@vng.com.vn, cs.studio9@vng.com.vn, ngoisao.360mobi.vn@gmail.com, pubgm@vng.com.vn, muawakening@vng.com.vn, vhdl@vng.com.vn",
    "publisher_name": "VNG Corporation",
    "publisher_website": "https://playtogether.vnggames.net",
    "release_date": "2022-06-29",
    "revenue_usd": 322689,
    "rpd": 0.32
  },
  {
    "app_name": "Mobile Legends: Bang Bang FT for Android - Free App Download",
    "package_name": "com.hhgame.mlbbvn",
    "Total downloads": "5 million",
    "Recent downloads": "630 thousand",
    "Rating": "4.43 based on 64 thousand ratings",
    "Ranking": "Not ranked",
    "APK size": "170.8 MB",
    "Ads": "NO ads",
    "developer_info": {
      "name": "Công ty cổ phần phát triển công nghệ số Hồng Hà",
      "email": "mobilelegendsgame@moonton.com",
      "website": null
    },
    "about_section": "Mobile Legends: Bang Bang FT is an action game developed by Công ty cổ phần phát triển công nghệ số Hồng Hà. The APK has been available since April 2024 . In the last 30 days, the app was downloaded about 630 thousand times. It's currently not in the top ranks. It's rated 4.43 out of 5 stars, based on 64 thousand ratings. The last update of the app was on April 18, 2025 . Mobile Legends: Bang Bang FT has a content rating \"Medium Maturity\" . Mobile Legends: Bang Bang FT has an APK download size of 170.82 MB and the latest version available is 1.9.68.10631 . Mobile Legends: Bang Bang FT is FREE to download.",
    "app_description": "Quyết định phê duyệt nội dung kịch bản số 842/QĐ-BTTTT cấp ngày 23/5/2024\nHãy cùng bạn bè tham gia Mobile Legends: Bang Bang, siêu phẩm MOBA 5v5 hoàn toàn mới, để tranh tài với những người chơi khác từ khắp nơi trên thế giới! Lựa chọn vị tướng mà bạn yêu thích để cùng đồng đội kiến tạo một đội hình tuyệt vời! Ghép đội trong 10 giây, tranh đấu trong 10 phút. Từ đi đường, đi rừng cho đến phá trụ và giao tranh, tất cả những thú vui từ các tựa game MOBA trên PC lẫn game hành động khác giờ đã nằm gọn trong lòng bàn tay! Hãy cho mọi người thấy tinh thần eSports đầy nhiệt huyết của bạn đi nào!\nMobile Legends: Bang Bang, tựa game MOBA đầy cuốn hút trên di động. Cùng đồng đội áp đảo đối phương để giành lấy vinh quang!\nHãy để chiếc điện thoại của bạn được thoả sức đắm mình trong những trận đấu nảy lửa!\nTính Năng:\n \n1. Bản Đồ MOBA Cổ Điển & Tranh Đấu 5v5\n \nNhững trận đấu 5v5 với những đối thủ thực tế. 3 đường, 4 khu vực rừng, 2 boss, 18 trụ phòng thủ, và những trận đấu không hồi kết, tất cả mọi thứ hội tụ trong một tựa game MOBA cổ điển đều có mặt ở đây!\n2. Đoàn Kết & Chiến Lược, Sức Mạnh & Vinh Quang\n \nTránh né sát thương, khống chế đối phương, và cứu giúp đồng đội! Hoá thân thành Đỡ Đòn, Pháp Sư, Xạ Thủ, Sát Thủ, Hỗ Trợ... để cân đối đội hình và sở hữu danh hiệu MVP của cả trận đấu! Các vị tướng mới sẽ được ra mắt định kỳ!\n3. Tranh Tài Cực Công Bằng, Gánh Team Và Chiến Thắng\n \nGiống như các tựa game MOBA cổ điển khác, các vị tướng ở đây không có chuyện nâng cấp để khoẻ hơn. Thuần thục kỹ năng và tư duy chiến lược mới là chìa khoá giúp bạn chiến thắng các trận đấu trong tựa game công bằng và cân đối này. Càng Luyện Càng Giỏi, chứ không phải Càng Nhiều Tiền Càng Tốt.\n4. Thao Tác Giản Đơn, Điều Khiển Dễ Dàng\n \nVới nút di chuyển bên trái và nút kỹ năng bên phải, chỉ cần 2 ngón tay để tôi luyện thành cao thủ! Tự động khoá và chuyển đổi mục tiêu cho phép bạn bứt phá khả năng của bản thân. Nhắm đâu cũng trúng! Đi kèm là một hệ thống chạm-để-dùng cực kỳ thuận tiện, cho phép bạn mua trang bị ở bất cứ đâu trên bản đồ, tăng sự tập trung vào diễn biến trận đấu!\n5. 10 Giây Ghép Đội, 10 Phút Tranh Đấu\n \nGhép đội chỉ mất 10 giây mà thôi, và một trận đấu diễn ra chỉ trong 10 phút. Hãy bỏ qua sự im ắng đầy nhàm chán ở đầu trận và hướng sự chú ý về những đợt giao tranh đầy gay cấn. Đừng chờ đợi và farm khắp nơi, hãy cố gắng áp đảo đối phương để dễ dàng chiến thắng. Mọi lúc mọi nơi, cứ cầm điện thoại lên, thổi bùng ngọn lửa trong bạn, và hoà minh vào những trận đấu MOBA hồi hộp đúng nghĩa.\n6. AI Hỗ Trợ Thông Minh\nSự cố mất mạng có thể khiến đội của bạn thất thủ trong một trận đấu đang trên đà gay cấn, nhưng với hệ thống kết nối lại cực hữu ích của Mobile Legends: Bang Bang, nếu gặp vấn đề về đường truyền, bạn vẫn có thể quay lại chỉ trong vài giây. Và trong khoảng thời gian bạn offline, hệ thống AI của game sẽ tạm thời điều khiển tướng của bạn để tránh xảy ra tình trạng 4-đấu-5.\nCHÚ Ý! Mobile Legends: Bang Bang là một tựa game có thể tải về và chơi miễn phí, nhưng vẫn sẽ có một vài vật phẩm trong game cần được mua bằng tiền. Nếu bạn muốn sử dụng tính năng này, hãy cài đặt bảo mật mật khẩu mua hàng trong phần cài đặt ở ứng dụng Cửa Hàng Google Play. Đồng thời, như đã ghi trong Điều Khoản Dịch Vụ và Chính Sách Bảo Mật, độ tuổi tối thiểu của người chơi phải là 12 tuổi để có thể chơi hoặc tải xuống Mobile Legends: Bang Bang.\nLiên Hệ Với Chúng Tôi\n \nNếu gặp bất cứ khó khăn nào khi chơi game, bạn có thể nhờ hỗ trợ từ bộ phận CSKH bằng cách ấn vào nút [Liên Hệ] trong game. Bạn cũng có thể liên hệ với chúng tôi thông qua các nền tảng bên dưới. Chúng tôi luôn chào đón những đề xuất, góp ý từ những người chơi Mobile Legends: Bang Bang\nDecision 842/QD-BTTTT issued on May 23, 2024",
    "api_details": {
      "permissions": {},
      "technologies": {},
      "raw_html_snippet": "<div>\n    <h2>\n        Permissions\n    </h2>\n    \n        <div class=\"row app-permissions\">\n            \n                <div class=\"col-sm-6 col-lg-4\">\n                    <div class=\"default-box-color vpadding-xs hpadding-s\">\n                        <b>Your personal information</b>\n                        <div>\n                            \n                                read calendar events plus confidential information,\n                            \n                                add or modify calendar events and send email to guests without owners&#x27; knowledge\n                            \n                        </div>\n                    </div>\n                </div>\n            \n                <div class=\"col-sm-6 col-lg-4\">\n                    <div class=\"default-box-color vpadding-xs hpadding-s\">\n                        <b>Your location</b>\n                        <div>\n                            \n                                approximate (network-based) location,\n     ..."
    },
    "changelog": [
      {
        "date": "Apr 18, 2025",
        "type": "Update",
        "description": "Version 1.9.68.10631"
      }
    ],
    "country": "US",
    "category": "Game",
    "status": "success",
    "url": "https://www.appbrain.com/app/body-color-swap/com.hhgame.mlbbvn",
    "timestamp": "2025-06-12T02:14:19.788837",
    "categories": "Game, Action",
    "downloads": 1646647,
    "is_ad": "YES",
    "is_pub": "NO",
    "market_url": "https://play.google.com/store/apps/details?hl=vi_VN&gl=vn&id=com.hhgame.mlbbvn",
    "name": "Mobile Legends: Bang Bang FT",
    "platform": "Android",
    "position": 4,
    "publisher_contacts": "Hotro@funtap.vn, hotro@hhgame.vn, Infosec@funtap.vn, mladventure.help@gmail.com, developer_coi@neocraftstudio.com, idlegog58@gmail.com, mobilelegendsgame@moonton.com, support@lastwar.com, liyiyi159987@gmail.com, battlefunna@global.netease.com, support_ls@im30.net, support_th@rivergame.net, mobilechess.help@moonton.com, nikkisupportvn@playpapergames.com, ageofapes_group@tap4fun.com, sosgame@kingsgroupgames.com, info@com2us.com, support_vampire@mechanist.co, cuichunhu@tanwan.com, marvelduel@163.com, kefusupport@im30.net, bloodstrike@global.netease.com, twdsvn@elex.com",
    "publisher_name": "Công ty cổ phần phát triển công nghệ số Hồng Hà",
    "publisher_website": null,
    "release_date": "2023-12-18",
    "revenue_usd": 162264,
    "rpd": 0.1
  }
]